Autodesk.Revit.UI.ContextualHelp.Launch
Launches and displays the help topic specified by the contents of this ContextualHelp object.
Since: 2013

Autodesk.Revit.UI.ContextualHelp.HelpTopicUrl
The help topic URL.
Remarks: Applies only to objects of type ContextualHelpType.ChmFile.  If empty or null, the default page of the help file will be displayed.
Obtain the URL by:
Open the chm file and go to the page you want to show. Right click on the page, and choose the Properties command. In the middle of properties page there is a property called: Address (URL).
The end of the URL contains the topic URL used to open the help file to the correct page.
Here is an example: mk:@MSITStore:C:\RevitAPI2013.chm::/WhatsNew.htm
The help topic URL of this page is "WhatsNew.htm".
Another example: mk:@MSITStore:C:\RevitAPI2013.chm::/html/329b02eb-5ee4-1715-2fbf-2cbbc0d3ff2a.htm
The help topic URL of this page is "html/329b02eb-5ee4-1715-2fbf-2cbbc0d3ff2a.htm".
Since: 2013

Autodesk.Revit.UI.ContextualHelp.HelpPath
The context id, help URL, or help file path.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when setting the help path to null or empty.
Since: 2013

Autodesk.Revit.UI.ContextualHelp.HelpType
The contextual help type.
Since: 2013

Autodesk.Revit.UI.ContextualHelp.#ctor(Autodesk.Revit.UI.ContextualHelpType,System.String)
Constructs a contextual help object.
helpType: The contextual help type.
helpPath: The contextual help path.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when the helpPath is null or empty.
Since: 2013

Autodesk.Revit.UI.ContextualHelp
Contains the details for how Revit should allow invocation of contextual help for an item added by an application.
Remarks: An instance of this class may be used to assign a contextual help location to any RibbonItem (through the RibbonItem.SetContextualHelp() method).
It is also possible to use an instance of this class to launch the help path and topic at any time (this permits association of help topics with
user interface components inside dialogs created by the add-in application).
Since: 2013